tutorials_HJ/pitzDailyBodyFitted/0/y
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      y;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
12225
(
0.000156695
0.000156695
0.000156695
0.000156695
0.000156695
0.000156695
0.000156695
0.000156695
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
0.000806782
0.000928841
0.00116114
0.00147988
0.00186846
0.00231937
0.00283083
0.00331613
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
57
(
0.00261758
0.00279523
0.0030708
0.00342069
0.00382457
0.00426714
0.00473756
0.00522832
...
)
;
    }
    upperWall
    {
        type            calculated;
        value           uniform 1e-15;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 1e-15;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
